---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.WallTypeUnsupportedError
source: html/142a4322-3112-5746-854a-2e6287bc0f3c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.WallTypeUnsupportedError Property

The selected wall type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallTypeUnsupportedError { get; }
```